{"config": [{"config": {"batch_input_shape": [null, 128, 96, 1], "dtype": "float32", "name": "input_1", "sparse": false}, "class_name": "InputLayer"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"value": 0.01}, "class_name": "Constant"}, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv2d_1", "trainable": true, "data_format": "channels_last", "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [11, 11], "filters": 32, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"value": 0.01}, "class_name": "Constant"}, "strides": [1, 1], "use_bias": true, "padding": "same", "batch_input_shape": [null, 1, 28, 28], "kernel_constraint": null, "name": "conv2d_2", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "kernel_size": [2, 2]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "units": 128, "activity_regularizer": null, "activation": "relu", "name": "dense_1", "bias_initializer": {"config": {"value": 0.01}, "class_name": "Constant"}, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "units": 4, "activity_regularizer": null, "activation": "softmax", "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Sequential"}