{"class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 128, 96, 3]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.01}}, "filters": 32, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_1", "kernel_size": [11, 11], "bias_constraint": null, "trainable": true, "padding": "same", "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "same", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "dtype": "float32", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.01}}, "batch_input_shape": [null, 1, 28, 28], "filters": 32, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_2", "kernel_size": [2, 2], "bias_constraint": null, "trainable": true, "padding": "same", "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "same", "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 128, "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.01}}, "bias_constraint": null, "activation": "relu", "name": "dense_1", "trainable": true, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 4, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "softmax", "name": "dense_2", "trainable": true, "kernel_regularizer": null}}], "keras_version": "2.1.2", "backend": "tensorflow"}