{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.2", "config": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 128, 96, 1], "name": "input_1", "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Constant", "config": {"value": 0.01}}, "padding": "same", "data_format": "channels_last", "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "filters": 32, "kernel_size": [11, 11], "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "same", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.01}}, "padding": "same", "data_format": "channels_last", "batch_input_shape": [null, 1, 28, 28], "name": "conv2d_2", "kernel_size": [2, 2], "use_bias": true, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "filters": 32, "activity_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "same", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.01}}, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "units": 128}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_2", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "activation": "softmax", "kernel_regularizer": null, "units": 4}}]}