{"config": [{"config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 128, 96, 3], "dtype": "float32"}, "class_name": "InputLayer"}, {"config": {"data_format": "channels_last", "filters": 32, "strides": [1, 1], "padding": "same", "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [11, 11], "name": "conv2d_1", "activity_regularizer": null, "bias_initializer": {"config": {"value": 0.01}, "class_name": "Constant"}, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "padding": "same", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "filters": 32, "strides": [1, 1], "batch_input_shape": [null, 1, 28, 28], "padding": "same", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [2, 2], "name": "conv2d_2", "activity_regularizer": null, "bias_initializer": {"config": {"value": 0.01}, "class_name": "Constant"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "padding": "same", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "activation": "relu", "trainable": true, "kernel_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "activity_regularizer": null, "bias_constraint": null, "units": 128, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {"value": 0.01}, "class_name": "Constant"}}, "class_name": "Dense"}, {"config": {"use_bias": true, "activation": "softmax", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "units": 4, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.2"}